JacobBachle/MSP432/lab8.c
//******************************************************************************
// Name of Function: serviceLeftMotorLED
// Description: Sets RSLK LEDs high or low based on current motor states.
// Input Parameters: void
// Return: none
// Author: Jacob Bachle
//******************************************************************************
void serviceLeftMotorLED(void) {
    switch(leftMotorState) {
    case motorOFF:
        // RSLK LED Front and Rear OFF
        MAP_GPIO_setOutputLowOnPin(GPIO_PORT_P8, GPIO_PIN0); // Front Left OFF
        MAP_GPIO_setOutputLowOnPin(GPIO_PORT_P8, GPIO_PIN6); // Rear Left OFF
        break;
    case motorForward:
        // RSLK LED Front ON Rear OFF
        MAP_GPIO_setOutputHighOnPin(GPIO_PORT_P8, GPIO_PIN0); // Front Left ON
        MAP_GPIO_setOutputLowOnPin(GPIO_PORT_P8, GPIO_PIN6);  // Rear Left OFF
        break;
    case motorReverse:
        // RSLK LED Rear ON Front OFF
        MAP_GPIO_setOutputLowOnPin(GPIO_PORT_P8, GPIO_PIN0);  // Front Left OFF
        MAP_GPIO_setOutputHighOnPin(GPIO_PORT_P8, GPIO_PIN6); // Rear Left ON
        break;
    case motorTest:
        //RSLK LED Front and Rear ON
        MAP_GPIO_setOutputHighOnPin(GPIO_PORT_P8, GPIO_PIN0);
        MAP_GPIO_setOutputHighOnPin(GPIO_PORT_P8, GPIO_PIN6);
        break;
    }
}

//******************************************************************************
// Name of Function: serviceRightMotorLED
// Description: Sets RSLK LEDs high or low based on current motor states.
// Input Parameters: void
// Return: none
// Author: Jacob Bachle
//******************************************************************************
void serviceRightMotorLED(void) {
    switch(rightMotorState) {
    case motorOFF:
        // RSLK LED Front and Rear OFF
        MAP_GPIO_setOutputLowOnPin(GPIO_PORT_P8, GPIO_PIN5); // Front Left OFF
        MAP_GPIO_setOutputLowOnPin(GPIO_PORT_P8, GPIO_PIN7); // Rear Left OFF
        break;
    case motorForward:
        // RSLK LED Front ON Rear OFF
        MAP_GPIO_setOutputHighOnPin(GPIO_PORT_P8, GPIO_PIN5); // Front Left ON
        MAP_GPIO_setOutputLowOnPin(GPIO_PORT_P8, GPIO_PIN7);  // Rear Left OFF
        break;
    case motorReverse:
        // RSLK LED Rear ON Front OFF
        MAP_GPIO_setOutputLowOnPin(GPIO_PORT_P8, GPIO_PIN5);  // Front Left OFF
        MAP_GPIO_setOutputHighOnPin(GPIO_PORT_P8, GPIO_PIN7); // Rear Left ON
        break;
    case motorTest:
        //RSLK LED Front and Rear ON
        MAP_GPIO_setOutputHighOnPin(GPIO_PORT_P8, GPIO_PIN5);
        MAP_GPIO_setOutputHighOnPin(GPIO_PORT_P8, GPIO_PIN7);
        break;
    }
}

//******************************************************************************
// Name of Function: toggleAllLEDSONTest
// Description: Turns all LEDS on. Used as a helper function in test mode.
// Input Parameters: void
// Return: none
// Author: Jacob Bachle
//******************************************************************************
void toggleAllLEDSONTest(void) {
    MAP_GPIO_setOutputHighOnPin(GPIO_PORT_P8, GPIO_PIN0 | GPIO_PIN5 | GPIO_PIN6 | GPIO_PIN7);
}

//******************************************************************************
// Name of Function: toggleAllLEDSOFFTest
// Description: Turns all LEDS off. Used as a helper function in test mode.
// Input Parameters: void
// Return: none
// Author: Jacob Bachle
//******************************************************************************
void toggleAllLEDSOFFTest(void) {
    MAP_GPIO_setOutputLowOnPin(GPIO_PORT_P8, GPIO_PIN0 | GPIO_PIN5 | GPIO_PIN6 | GPIO_PIN7);
}

//******************************************************************************
// Name of Function: toggleRSLKLEDTest
// Description: Turns all LEDS of, after a 3 second delay, turns all LEDs off.
// Input Parameters: void
// Return: none
// Author: Jacob Bachle
//******************************************************************************
void toggleRSLKLEDTest(void) {
    turnOnWhiteLED2();
    toggleAllLEDSONTest();
    __delay_cycles(9000000); //aprox. 3 seconds
    toggleAllLEDSOFFTest();
    turnOffWhiteLED2();
}

//******************************************************************************
// Name of Function: bumperSwitchesHandler
// Description: Updates bumper states.
// Input Parameters: void
// Return: none
// Author: Jacob Bachle
//******************************************************************************
void bumperSwitchesHandler(void) {
    uint16_t status;
    _delay_cycles(30000);
    status = MAP_GPIO_getEnabledInterruptStatus(GPIO_PORT_P4);
    switch(status){
        case GPIO_PIN6: //BPM5
            if (BMPn == bumperOFF) {
                BMPn = bumperON;
            }
            else {
                BMPn = bumperOFF;
            }
            //GPIO_clearInterruptFlag(GPIO_PORT_P4, GPIO_PIN6);
            break;
        case GPIO_PIN5: //BMP4
            if (BMPn == bumperOFF) {
                BMPn = bumperON;
            }
            else {
                BMPn = bumperOFF;
            }
            //GPIO_clearInterruptFlag(GPIO_PORT_P4, GPIO_PIN5);
            break;
        case GPIO_PIN4: //BPM3
            if (BMPn == bumperOFF) {
                BMPn = bumperON;
            }
            else {
                BMPn = bumperOFF;
            }
            //GPIO_clearInterruptFlag(GPIO_PORT_P4, GPIO_PIN4);
            break;
        case GPIO_PIN3: //BMP2
            if (BMPn == bumperOFF) {
                BMPn = bumperON;
            }
            else {
                BMPn = bumperOFF;
            }
            //GPIO_clearInterruptFlag(GPIO_PORT_P4, GPIO_PIN3);
            break;
        case GPIO_PIN2: //BMP1
            if (BMPn == bumperOFF) {
                BMPn = bumperON;
            }
            else {
                BMPn = bumperOFF;
            }
            //GPIO_clearInterruptFlag(GPIO_PORT_P4, GPIO_PIN2);
            break;
        case GPIO_PIN0: // BMP0
            if (BMP0 == bumperOFF) {
                BMP0 = bumperON;
            }
            else {
                BMP0 = bumperOFF;
            }
            //GPIO_clearInterruptFlag(GPIO_PORT_P4, GPIO_PIN0);
            break;
        //End of Case
    }

    MAP_GPIO_clearInterruptFlag(GPIO_PORT_P4, status);

    //readBumperSwitches();
}

