JacobBachle/MSP432/lab8.c
//******************************************************************************
// Name of Function: processSensorData
// Description: Counts sensor values to count how many senesors indicate right
// and left activation.
// Input Parameters: void
// Return: none
// Author: Jacob Bachle
//******************************************************************************
void processSensorData(void) {
    leftCount = 0;
    rightCount = 0;
    if ((sensorValues & BIT0)) {
        leftCount++;
    }
    if ((sensorValues & BIT1)) {
        leftCount++;
    }
    if ((sensorValues & BIT2)) {
        leftCount++;
    }
    if ((sensorValues & BIT3)) {
        leftCount++;
    }

    if ((sensorValues & BIT4)) {
        rightCount++;
    }
    if ((sensorValues & BIT5)) {
        rightCount++;
    }
    if ((sensorValues & BIT6)) {
        rightCount++;
    }
    if ((sensorValues & BIT7)) {
        rightCount++;
    }
}

//******************************************************************************
// Name of Function: LEDStatesControl
// Description: Using processed sensor data, to determine the positon the RSLK
// is on the track mapped to an LED2 state.
// Input Parameters: void
// Return: none
// Author: Jacob Bachle
//******************************************************************************
void LEDStatesControl(void) {
    totalCount = (leftCount + rightCount);

    if (totalCount == 0) {
        LED2State = WHITE;
        currentCorrectionNeeded = lost;
    }
    else if (leftCount == rightCount) {
        LED2State = GREEN;
        currentCorrectionNeeded = stright;
    }
    else if ((leftCount > 0) & (rightCount == 0)) {
        LED2State = RED;
        currentCorrectionNeeded = hardRight;
    }
    else if ((rightCount > 0) & (leftCount == 0)) {
        LED2State = BLUE;
        currentCorrectionNeeded = hardLeft;
    }
    else if (leftCount > rightCount) {
        LED2State = YELLOW;
        currentCorrectionNeeded = right;
    }
    else if (rightCount > leftCount) {
        LED2State = CYAN;
        currentCorrectionNeeded = left;
    }

    /*
    // LED1 mode control
    switch(currentMode) {
        case PowerUp:
            // Toggle LED1 once
            GPIO_toggleOutputOnPin(GPIO_PORT_P1, GPIO_PIN0);
            __delay_cycles(1500000); //Delay 500 ms
            GPIO_toggleOutputOnPin(GPIO_PORT_P1, GPIO_PIN0);

            // Toggle LED2 white once
            GPIO_toggleOutputOnPin(GPIO_PORT_P2, GPIO_PIN0 | GPIO_PIN1 | GPIO_PIN2);
            __delay_cycles(1500000); //Delay 500 ms
            GPIO_toggleOutputOnPin(GPIO_PORT_P2, GPIO_PIN0 | GPIO_PIN1 | GPIO_PIN2);
            break;
        case StandBy:
            if (totalCount > 0) {
                //Toggle LED1 at 1 Hz
                GPIO_toggleOutputOnPin(GPIO_PORT_P1, GPIO_PIN0);
                __delay_cycles(1500000); //Delay 500 ms
            }
            else {
                LED1State = off;
            }
            break;
        case Tracking:
            LED1State = on;
            break;
        case Lost:
            LED1State = off;
            break;
    }
    */
}

//******************************************************************************
// Name of Function: turnOnWhiteLED2
// Description: ToggleLED helper function. Turns on white led
// Input Parameters: void
// Return: none
// Author: Jacob Bachle
//******************************************************************************
void turnOnWhiteLED2(void) {
    P1->OUT |= BIT0;
    GPIO_setOutputHighOnPin(GPIO_PORT_P2, GPIO_PIN0 | GPIO_PIN1 | GPIO_PIN2);
}

//******************************************************************************
// Name of Function: turnOffWhiteLED2
// Description: ToggleLED helper function. Turns off white led
// Input Parameters: void
// Return: none
// Author: Jacob Bachle
//******************************************************************************
void turnOffWhiteLED2(void) {
    P1->OUT &= ~BIT0;
    GPIO_setOutputLowOnPin(GPIO_PORT_P2, GPIO_PIN0 | GPIO_PIN1 | GPIO_PIN2);
}

//******************************************************************************
// Name of Function: serviceLEDs
// Description: Updates LED2 to match the LED2 state.
// Input Parameters: void
// Return: none
// Author: Jacob Bachle
//******************************************************************************
void serviceLEDs(void) {
    GPIO_setOutputLowOnPin(GPIO_PORT_P2, GPIO_PIN0 | GPIO_PIN1 | GPIO_PIN2); //Sets all LED pins to low
    switch(LED1State) {
    case on:
        GPIO_setOutputHighOnPin(GPIO_PORT_P1, GPIO_PIN0);
        break;
    case off:
        //Turn off LED1, already off
        break;
    }
    switch(LED2State) {
    case WHITE:
        //Turn on white
        GPIO_setOutputHighOnPin(GPIO_PORT_P2, GPIO_PIN0 | GPIO_PIN1 | GPIO_PIN2);
        break;
    case RED:
        //Turn on red
        GPIO_setOutputHighOnPin(GPIO_PORT_P2, GPIO_PIN0);
        break;
    case BLUE:
        //Turn on blue
        GPIO_setOutputHighOnPin(GPIO_PORT_P2, GPIO_PIN2);
        break;
    case YELLOW:
        GPIO_setOutputHighOnPin(GPIO_PORT_P2, GPIO_PIN0 | GPIO_PIN1);
        break;
    case CYAN:
        GPIO_setOutputHighOnPin(GPIO_PORT_P2, GPIO_PIN1 | GPIO_PIN2);
        break;
    case GREEN:
        //turn on green
        GPIO_setOutputHighOnPin(GPIO_PORT_P2, GPIO_PIN1);
        break;
    }
}

//******************************************************************************
// Name of Function: readLineSensors
// Description: Configures Timer_A PWM channel for selected wheel
// Input Parameters: clockPeriod, clockDivider, duty cycle %, channel
// Return: none
// Author: Rafael Cano
//******************************************************************************
void readLineSensors(void) {
    sensorValues = 0;
    MAP_GPIO_setOutputHighOnPin(GPIO_PORT_P5, GPIO_PIN3);
    MAP_GPIO_setOutputHighOnPin(GPIO_PORT_P9, GPIO_PIN2);

    MAP_GPIO_setAsOutputPin(GPIO_PORT_P7, GPIO_PIN0 | GPIO_PIN1 | GPIO_PIN2 | GPIO_PIN3 | GPIO_PIN4 | GPIO_PIN5 | GPIO_PIN6 | GPIO_PIN7);
    MAP_GPIO_setOutputHighOnPin(GPIO_PORT_P7, GPIO_PIN0 | GPIO_PIN1 | GPIO_PIN2 | GPIO_PIN3 | GPIO_PIN4 | GPIO_PIN5 | GPIO_PIN6 | GPIO_PIN7);
    __delay_cycles(30);
    MAP_GPIO_setAsInputPin(GPIO_PORT_P7, GPIO_PIN0 | GPIO_PIN1 | GPIO_PIN2 | GPIO_PIN3 | GPIO_PIN4 | GPIO_PIN5 | GPIO_PIN6 | GPIO_PIN7);
    __delay_cycles(3000);
    //sensorValues = MAP_GPIO_getInputPinValue(GPIO_PORT_P7, GPIO_PIN0 | GPIO_PIN1 | GPIO_PIN2 | GPIO_PIN3 | GPIO_PIN4 | GPIO_PIN5 | GPIO_PIN6 | GPIO_PIN7);

