JacobBachle/MSP432/lab8.c
    if (MAP_GPIO_getInputPinValue(GPIO_PORT_P7, GPIO_PIN0)) {
        sensorValues |= BIT0;
    }
    if (MAP_GPIO_getInputPinValue(GPIO_PORT_P7, GPIO_PIN1)) {
        sensorValues |= BIT1;
    }
    if (MAP_GPIO_getInputPinValue(GPIO_PORT_P7, GPIO_PIN2)) {
        sensorValues |= BIT2;
    }
    if (MAP_GPIO_getInputPinValue(GPIO_PORT_P7, GPIO_PIN3)) {
        sensorValues |= BIT3;
    }
    if (MAP_GPIO_getInputPinValue(GPIO_PORT_P7, GPIO_PIN4)) {
        sensorValues |= BIT4;
    }
    if (MAP_GPIO_getInputPinValue(GPIO_PORT_P7, GPIO_PIN5)) {
        sensorValues |= BIT5;
    }
    if (MAP_GPIO_getInputPinValue(GPIO_PORT_P7, GPIO_PIN6)) {
        sensorValues |= BIT6;
    }
    if (MAP_GPIO_getInputPinValue(GPIO_PORT_P7, GPIO_PIN7)) {
        sensorValues |= BIT7;
    }

    MAP_GPIO_setOutputLowOnPin(GPIO_PORT_P5, GPIO_PIN3);
    MAP_GPIO_setOutputLowOnPin(GPIO_PORT_P9, GPIO_PIN2);
    //return data;
}

//******************************************************************************
// Name of Function: handleStandBy
// Description: Uses helper function to read and process sensor data to update
// LED2 state.
// Return: none
// Author: Rafael Cano
//******************************************************************************
void handleStandBy(void) {
    readLineSensors();
    processSensorData();
    LEDStatesControl();
    serviceLEDs();
    __delay_cycles(30000); //Delay 500 ms
}

//******************************************************************************
// Name of Function: updateDutyState
// Description: Updates the duty of the left and right based on the correction
// needed.
// Return: none
// Author: Rafael Cano
//******************************************************************************
void updateDutyState(void) {
    switch (currentCorrectionNeeded) {
    case hardLeft:
        currentSpeedL = fastDuty;
        currentSpeedR = slowDuty;
        break;
    case left:
        currentSpeedL = medDuty;
        currentSpeedR = slowDuty;
        break;
    case stright:
        currentSpeedL = medDuty;
        currentSpeedR = medDuty;
        break;
    case hardRight:
        currentSpeedL = slowDuty;
        currentSpeedR = fastDuty;
        break;
    case right:
        currentSpeedL = slowDuty;
        currentSpeedR = medDuty;
        break;
    case lost:
        currentSpeedL = slowDuty;
        currentSpeedR = slowDuty;
        break;
    }
}

//******************************************************************************
// Name of Function: configPWMTimer
// Description: Configures Timer_A PWM channel for selected wheel
// Input Parameters: clockPeriod, clockDivider, duty cycle %, channel
// Return: none
// Author: Jacob Bachle
//******************************************************************************
void configPWMTimer(uint16_t clockPeriod, uint16_t clockDivider, uint16_t duty, uint16_t channel) {
    uint16_t dutyCycle = duty * clockPeriod / 100;
    timerPWMConfig.clockSource = TIMER_A_CLOCKSOURCE_SMCLK;
    timerPWMConfig.clockSourceDivider = clockDivider;
    timerPWMConfig.timerPeriod = clockPeriod;
    timerPWMConfig.compareOutputMode =
    TIMER_A_OUTPUTMODE_TOGGLE_SET;
    timerPWMConfig.compareRegister = channel;
    timerPWMConfig.dutyCycle = dutyCycle;

    MAP_Timer_A_generatePWM(TIMER, &timerPWMConfig);
    MAP_Timer_A_stopTimer(TIMER);
}
